{
  "irVersion": "8",
  "graph": {
    "node": [
      {
        "input": [
          "boxes",
          "scores",
          "max_output_boxes_per_class",
          "iou_threshold",
          "score_threshold"
        ],
        "output": [
          "selected_indices"
        ],
        "opType": "NonMaxSuppression",
        "attribute": [
          {
            "name": "center_point_box",
            "i": "1",
            "type": "INT"
          }
        ]
      }
    ],
    "name": "onnx_graphsurgeon_graph",
    "input": [
      {
        "name": "boxes",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "6"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "scores",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "6"
                }
              ]
            }
          }
        }
      },
      {
        "name": "max_output_boxes_per_class",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "iou_threshold",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "score_threshold",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "selected_indices",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimValue": "3"
                },
                {
                  "dimValue": "3"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "",
      "version": "11"
    }
  ]
}